app/controllers/welcome_controller.rb

DELETE FROM "savedmsgs" WHERE "savedmsgs"."id" = $1  [["id", 1]]
SELECT  "savedmsgs".* FROM "savedmsgs" WHERE "savedmsgs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def read

		gid = params[:id]
			if(gid.to_i == -69)
				$curID = 0
				Savedmsg.delete_all
				return 0
			end
		data = Savedmsg.find_by_id(gid.to_i)

INSERT INTO "savedmsgs" ("id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 1], ["text", "da"], ["created_at", "2017-10-28 21:41:19.223035"], ["updated_at", "2017-10-28 21:41:19.223035"]]
---
	def new
		text = params[:text]
		id = get_id
		Savedmsg.create(:id => id, :text => text)